# Projeto de Bases de Dados - Parte 3

### Docente Responsável

Prof. FirstName LastName

### Grupo GG
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
<dl>

In [1]:
%load_ext sql
%sql postgresql://db:db@postgres/db

# Empresa de comércio online

## 0. Carregamento da Base de Dados

Carregue o esquema de Base de Dados apresentado no Anexo A.

In [10]:
%%sql
DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS orders CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;
CREATE TABLE customer(
cust_no INTEGER PRIMARY KEY,
name VARCHAR(80) NOT NULL,
email VARCHAR(254) UNIQUE NOT NULL,
phone VARCHAR(15),
address VARCHAR(255) /*CHECK (address ~ '^[0-9]+\s*[a-zA-ZÀ-ú]+,\s*[0-9]{4}-[0-9]{3}\s*[a-zA-ZÀ-ú]+$')*/
);
CREATE TABLE orders(
order_no INTEGER PRIMARY KEY,
cust_no INTEGER NOT NULL REFERENCES customer,
date DATE NOT NULL
/*order_no must exist in contains*/
);
CREATE TABLE pay(
order_no INTEGER PRIMARY KEY REFERENCES orders,
cust_no INTEGER NOT NULL REFERENCES customer
);
CREATE TABLE employee(
ssn VARCHAR(20) PRIMARY KEY,
TIN VARCHAR(20) UNIQUE NOT NULL,
bdate DATE,
name VARCHAR NOT NULL,
CHECK (AGE(CURRENT_DATE, bdate) >= INTERVAL '18 years')
--age must be >=18
);
CREATE TABLE process(
ssn VARCHAR(20) REFERENCES employee,
order_no INTEGER REFERENCES orders,
PRIMARY KEY (ssn, order_no)
);
CREATE TABLE department(
name VARCHAR PRIMARY KEY
);
CREATE TABLE workplace(
address VARCHAR PRIMARY KEY,
lat NUMERIC(8, 6) NOT NULL,
long NUMERIC(9, 6) NOT NULL,
UNIQUE(lat, long)
    
--address must be in warehouse or office but not both
);

CREATE OR REPLACE FUNCTION check_workplace_address(address VARCHAR)
  RETURNS BOOLEAN AS
$$
BEGIN
  IF EXISTS (
    SELECT 1 FROM office WHERE address = check_workplace_address.address
  ) THEN
    IF EXISTS (
      SELECT 1 FROM warehouse WHERE address = check_workplace_address.address
    ) THEN
      RETURN FALSE;
    END IF;
  END IF;

  RETURN TRUE;
END;
$$
LANGUAGE plpgsql;

CREATE TABLE office(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);
CREATE TABLE warehouse(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);
CREATE TABLE works(
ssn VARCHAR(20) REFERENCES employee,
name VARCHAR(200) REFERENCES department,
address VARCHAR(255) REFERENCES workplace,
PRIMARY KEY (ssn, name, address)
);
CREATE TABLE product(
SKU VARCHAR(25) PRIMARY KEY,
name VARCHAR(200) NOT NULL,
description VARCHAR,
price NUMERIC(10, 2) NOT NULL,
ean NUMERIC(13) UNIQUE
);
CREATE TABLE contains(
order_no INTEGER REFERENCES orders,
SKU VARCHAR(25) REFERENCES product,
qty INTEGER,
PRIMARY KEY (order_no, SKU)
);
CREATE TABLE supplier(
TIN VARCHAR(20) PRIMARY KEY,
name VARCHAR(200),
address VARCHAR(255),
SKU VARCHAR(25) REFERENCES product,
date DATE
);
CREATE TABLE delivery(
address VARCHAR(255) REFERENCES warehouse,
TIN VARCHAR(20) REFERENCES supplier,
PRIMARY KEY (address, TIN)
);

Running query in 'postgresql://db:***@postgres/db'

Crie as instruções para o seu preenchimento de forma consistente, garantindo que todas as consultas SQL e OLAP, apresentadas mais adiante, produzam um resultado não vazio.

In [12]:
%%sql
/* inserting into the costumers table*/
INSERT INTO customer (cust_no, name, email, phone, address)
VALUES
(1, 'Zeus', 'zeus@example.com', '1234567890', '121 Mount Olympus,1234-456 Greece'),
(2, 'Hera', 'hera@example.com', '9876543210', '010 Olympus Street,5432-123 Greece');

/*inserting into the orders table*/
INSERT INTO orders (order_no, cust_no, date)
VALUES
(1, 1, '2023-06-01'),
(2, 2, '2023-06-05');

/*pay table*/
INSERT INTO pay (order_no, cust_no)
VALUES
(1, 1),
(2, 2);

/*emplpyee table*/
INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
('111111111', '111111111', '1990-01-01', 'Apollo'),
('222222222', '222222222', '1995-02-02', 'Artemis');

/*check the age check*/
INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
('123', '123', '2020-01-01', 'someone');

/*process table*/
INSERT INTO process (ssn, order_no)
VALUES
('111111111', 1),
('222222222', 2);

/*departemnet*/
INSERT INTO department (name)
VALUES
('Development'),
('Sales');

/*workplace*/
INSERT INTO workplace (address, lat, long)
VALUES
('123 Main Street', 37.983809, 23.727538),
('456 Elm Street', 38.011663, 23.732757);

/*office*/
INSERT INTO office (address)
VALUES
('123 Main Street');

INSERT INTO warehouse (address)
VALUES
('456 Elm Street');

/*works*/
INSERT INTO works (ssn, name, address)
VALUES
('111111111', 'Development', '123 Main Street'),
('222222222', 'Sales', '456 Elm Street');

/*product*/
INSERT INTO product (SKU, name, description, price, ean)
VALUES
('P1', 'Thunderbolt', 'Powerful weapon', 99.99, 1234567890123),
('P2', 'Moonbow', 'Ethereal bow', 149.99, 9876543210987);

/*contains*/
INSERT INTO contains (order_no, SKU, qty)
VALUES
(1, 'P1', 2),
(2, 'P2', 1);

/*suplier*/
INSERT INTO supplier (TIN, name, address, SKU, date)
VALUES
('S1', 'Athena Supplies', 'Mount Olympus, 12345 Greece', 'P1', '2023-06-02'),
('S2', 'Hermes Delivery', 'Olympus Street, 54321 Greece', 'P2', '2023-06-06');

/*delivery*/
INSERT INTO delivery (address, TIN)
VALUES
('456 Elm Street', 'S2');

Running query in 'postgresql://db:***@postgres/db'

(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "customer_pkey"
DETAIL:  Key (cust_no)=(1) already exists.

[SQL: /* inserting into the costumers table*/
INSERT INTO customer (cust_no, name, email, phone, address)
VALUES
(1, 'Zeus', 'zeus@example.com', '1234567890', '121 Mount Olympus,1234-456 Greece'),
(2, 'Hera', 'hera@example.com', '9876543210', '010 Olympus Street,5432-123 Greece');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

## 1. Restrições de Integridade

Apresente o código para implementar as seguintes restrições de integridade, se necessário, com recurso a extensões procedimentais SQL (Stored Procedures e Triggers):

(RI-1) Nenhum empregado pode ter menos de 18 anos de idade

In [ ]:
%%sql
-- (RI-1)

(RI-2) Um 'Workplace' é obrigatoriamente um 'Office' ou 'Warehouse' mas não pode ser ambos

In [ ]:
%%sql
-- (RI-2)

(RI-3) Uma 'Order' tem de figurar obrigatoriamente em 'Contains'.

In [ ]:
%%sql
-- (RI-3)

## 2. Consultas SQL

Apresente a consulta SQL mais sucinta para cada uma das seguintes questões

1) Qual o número e nome do(s) cliente(s) com maior valor total de encomendas pagas?

In [ ]:
%%sql
-- SELECT ...

2. Qual o nome dos empregados que processaram encomendas em todos os dias de 2022 em que houve encomendas?

In [ ]:
%%sql
-- SELECT ...

3. Quantas encomendas foram realizadas mas não pagas em cada mês de 2022?

In [ ]:
%%sql
-- SELECT ...

## 3. Vistas

Crie uma vista que resuma as informações mais importantes sobre as vendas de produtos, combinando informações de diferentes tabelas do esquema de base de dados. A vista deve ter o seguinte esquema:

product_sales(sku, order_no, qty, total_price, year, month, day_of_month, day_of_week, city)

In [ ]:
%%sql
-- CREATE VIEW ...

## 4. Desenvolvimento de Aplicação

### Explicação da arquitetura da aplicação web, incluindo um link para uma versão de trabalho e as relações entre os vários ficheiros na pasta web/arquivos

...

## 5. Consultas OLAP

Usando a vista desenvolvida para a Questão 3, escreva duas consultas SQL que permitam analisar:

1. As quantidade e valores totais de venda de cada produto em 2022, globalmente, por cidade, por mês, dia do mês e dia da semana

In [14]:
%%sql

SELECT
  pr.name AS product_name,
  EXTRACT(YEAR FROM o.date) AS sales_year,
  COALESCE(w.address, 'Global') AS city,
  EXTRACT(MONTH FROM o.date) AS sales_month,
  EXTRACT(DAY FROM o.date) AS day_of_month,
  EXTRACT(DOW FROM o.date) AS day_of_week,
  SUM(c.qty) AS total_quantity,
  SUM(c.qty * pr.price) AS total_value
FROM
  orders o
  JOIN contains c ON o.order_no = c.order_no
  JOIN product pr ON c.sku = pr.sku
  LEFT JOIN customer cust ON o.cust_no = cust.cust_no
  LEFT JOIN workplace w ON cust.address = w.address
WHERE
  o.date >= '2022-01-01' AND o.date < '2023-01-01'
GROUP BY
  ROLLUP (pr.name, sales_year, city, sales_month, day_of_month, day_of_week)
ORDER BY
  sales_year, city, sales_month, day_of_month, day_of_week, pr.name;

Running query in 'postgresql://db:***@postgres/db'

1 rows affected.

+--------------+------------+------+-------------+--------------+-------------+----------------+-------------+
| product_name | sales_year | city | sales_month | day_of_month | day_of_week | total_quantity | total_value |
+--------------+------------+------+-------------+--------------+-------------+----------------+-------------+
|     None     |    None    | None |     None    |     None     |     None    |      None      |     None    |
+--------------+------------+------+-------------+--------------+-------------+----------------+-------------+

2. O valor médio diário das vendas de todos os produtos em 2022, globalmente, por mês e dia da semana

In [15]:
%%sql
SELECT 
    EXTRACT(MONTH FROM o.date) AS sales_month,
    EXTRACT(DOW FROM o.date) AS day_of_week,
    AVG(c.qty * pr.price) AS avg_daily_sales
FROM
    orders o
    JOIN contains c ON o.order_no = c.order_no
    JOIN product pr ON c.sku = pr.sku
WHERE
    o.date >= '2022-01-01' AND o.date < '2023-01-01'
GROUP BY
    GROUPING SETS (
        (sales_month, day_of_week), 
        (sales_month), 
        (day_of_week)
    )
ORDER BY
    sales_month, day_of_week;

Running query in 'postgresql://db:***@postgres/db'

+-------------+-------------+-----------------+
| sales_month | day_of_week | avg_daily_sales |
+-------------+-------------+-----------------+
+-------------+-------------+-----------------+

## 6. Índices

Indique, com a devida justificação, que tipo de índice(s), sobre qual(is) atributo(s) e sobre qual(is) tabela(s) faria sentido criar, de forma a agilizar a execução de cada uma das seguintes consultas:

### 6.1
SELECT order_no
FROM orders 
JOIN contains USING (order_no) 
JOIN product USING (SKU) 
WHERE price > 50 AND 
EXTRACT(YEAR FROM date) = 2023

### Tipo de Índice, Atributos & Justificação

...

### 6.2
SELECT order_no, SUM(qty*price)
FROM contains 
JOIN product USING (SKU) 
WHERE name LIKE ‘A%’ 
GROUP BY order_no;

### Tipo de Índice, Atributos & Justificação

...